Pandas is a Python library used for working with tabular data (rows and columns).
It provides two main objects:

Series → 1D data (like a list)
DataFrame → 2D data (like an Excel table)

In [ ]:
import pandas as pd


# create the Dataframe using the dictionary and pandas
data = {
	'Name' : ['Rohith', 'Carl', "Manoj", "Sudeep"],
	'Age' : [23, 14, 28, 32],
	'Country' : ['India', 'USA', 'India', 'India']
}

df = pd.DataFrame(data)

print(df)

     Name  Age Country
0  Rohith   23   India
1    Carl   14     USA
2   Manoj   28   India
3  Sudeep   32   India

Loading the DataFrame

Pandas can load many types of files, mainly for data analysis. Common ones are:

CSV – pd.read_csv("file.csv")
Excel – pd.read_excel("file.xlsx")
JSON – pd.read_json("file.json")
SQL – pd.read_sql(query, connection)
HTML – pd.read_html("file.html")
Parquet – pd.read_parquet("file.parquet")
Text – pd.read_table("file.txt")

In [11]:
# load the data from the csv file
df = pd.read_csv("orders.csv")
# load the data from the Excel file
df = pd.read_excel('student_data.xlsx')
# load the data from dictionary
df = pd.DataFrame(data)

Exploring a DataFrame

In [18]:
df = pd.read_csv("orders.csv")

# display the first five rows
df.head()

# display the last five rows
df.tail()

# dispaly the infomation about df like column types and non-null values
df.info()

# display stas of numeric columns
df.describe()

# display the column names
df.columns

# Row indices details
df.index

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40 entries, 0 to 39
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   OrderID       40 non-null     int64
 1   CustomerName  40 non-null     object
 2   Product       40 non-null     object
 3   Category      40 non-null     object
 4   Quantity      40 non-null     int64
 5   Price         40 non-null     float64
 6   OrderDate     40 non-null     object
 7   Shipped       40 non-null     object
 8   Country       40 non-null     object
dtypes: float64(1), int64(2), object(6)
memory usage: 2.9+ KB

RangeIndex(start=0, stop=40, step=1)

ACCESSING AND FILTERING DATA

In [ ]:
# display the single column in series format 
df['Country']

# display the single column in dataframe format
df[['Country']]

# display the multiple column in dataframe format
df[['CustomerName', 'Product']]

# display the first row by it's index in series format
df.iloc[0]

# display the first row by it's index in dataframe format (iloc = integer location)
# position-based
df.iloc[[0]]

# display the first row by it's label in dataframe format 
# label-based
df.loc[[0]]

,OrderID,CustomerName,Product,Category,Quantity,Price,OrderDate,Shipped,Country
0,1001,John Smith,Laptop,Electronics,1,1200.0,2024-06-01,Yes,USA

CONDITIONAL FILTERING (BOOLEAN MASKS)

In [ ]:
# display customer record which quantity is greater than 3
df[df['Quantity'] > 3]

# display customer record which category is electronics
df[df['Category'] == 'Electronics']

# Multiple conditions
# display customer record which category is electronics and country is Japan
df[(df["Category"] == "Electronics") & (df["Country"] == "Japan")]

,OrderID,CustomerName,Product,Category,Quantity,Price,OrderDate,Shipped,Country
9,1010,Takeshi Nakamura,Mouse,Electronics,1,35.0,2024-06-11,Yes,Japan
18,1019,Yuki Tanaka,Calculator,Electronics,1,15.0,2024-06-20,Yes,Japan
34,1035,Yuki Yamamoto,Monitor Stand,Electronics,1,55.0,2024-07-06,Yes,Japan

ADVANCED FILTERING

In [77]:
# display the customer record whose names is starts with M
df[df["CustomerName"].str.startswith('M')]

# display the customer record whose names is ends with s
df[df["CustomerName"].str.endswith('s')]

# display the customer record whose Country is Canada or USA
# Match multiple values
df[df['Country'].isin(['Canada', 'USA'])]

# display the customer record whose Country other than Canada or USA
# Not condition
df[~df['Country'].isin(['Canada', 'USA'])]

,OrderID,CustomerName,Product,Category,Quantity,Price,OrderDate,Shipped,Country
2,1003,Ali Khan,Office Chair,Furniture,1,300.0,2024-06-04,Yes,UAE
3,1004,Alice Wong,Desk Lamp,Furniture,3,45.0,2024-06-05,Yes,Singapore
4,1005,Carlos Mendez,Keyboard,Electronics,2,80.0,2024-06-06,No,Mexico
5,1006,Nora Ibrahim,Notebook,Stationery,5,5.0,2024-06-07,Yes,UAE
6,1007,Emily Davis,Standing Desk,Furniture,1,450.0,2024-06-08,Yes,UK
7,1008,James Park,Monitor,Electronics,2,220.0,2024-06-09,No,South Korea
8,1009,Maria Rossi,Pen,Stationery,10,1.5,2024-06-10,Yes,Italy
9,1010,Takeshi Nakamura,Mouse,Electronics,1,35.0,2024-06-11,Yes,Japan
10,1011,Sophie Martin,Webcam,Electronics,1,85.0,2024-06-12,Yes,France
11,1012,Raj Patel,File Cabinet,Furniture,2,180.0,2024-06-13,No,India
12,1013,Emma Wilson,Stapler,Stationery,3,12.0,2024-06-14,Yes,Australia
13,1014,Diego Rodriguez,USB Drive,Electronics,5,25.0,2024-06-15,Yes,Spain
14,1015,Lisa Chen,Bookshelf,Furniture,1,280.0,2024-06-16,No,China
15,1016,Ahmed Hassan,Printer Paper,Stationery,20,8.0,2024-06-17,Yes,Egypt
16,1017,Anna Kowalski,Wireless Mouse,Electronics,2,45.0,2024-06-18,Yes,Poland
18,1019,Yuki Tanaka,Calculator,Electronics,1,15.0,2024-06-20,Yes,Japan
19,1020,Fatima Al-Zahra,Whiteboard,Furniture,1,120.0,2024-06-21,Yes,Saudi Arabia
21,1022,Isabella Silva,Bluetooth Speaker,Electronics,1,95.0,2024-06-23,Yes,Brazil
22,1023,Oliver Schmidt,Office Plant,Furniture,2,35.0,2024-06-24,Yes,Germany
23,1024,Zara Ahmed,Sticky Notes,Stationery,15,4.0,2024-06-25,No,Pakistan
24,1025,Lucas Anderson,Tablet Stand,Electronics,1,28.0,2024-06-26,Yes,Sweden
25,1026,Chloe Dubois,Paper Shredder,Electronics,1,75.0,2024-06-27,Yes,France
26,1027,Miguel Torres,Desk Chair Mat,Furniture,1,22.0,2024-06-28,No,Argentina
27,1028,Nina Petrov,Binder Clips,Stationery,12,2.5,2024-06-29,Yes,Russia
28,1029,Seo-yeon Kim,Wireless Keyboard,Electronics,1,110.0,2024-06-30,Yes,South Korea
29,1030,Giuseppe Romano,Desk Calendar,Furniture,1,18.0,2024-07-01,No,Italy
30,1031,Amira Hassan,USB Hub,Electronics,1,32.0,2024-07-02,Yes,Morocco
31,1032,Thomas Müller,Document Scanner,Electronics,1,140.0,2024-07-03,Yes,Germany
32,1033,Sofia Rodriguez,Desk Drawer Organizer,Furniture,1,42.0,2024-07-04,No,Colombia
34,1035,Yuki Yamamoto,Monitor Stand,Electronics,1,55.0,2024-07-06,Yes,Japan
35,1036,Emma Thompson,Desk Lamp with USB,Furniture,1,68.0,2024-07-07,No,UK
36,1037,Carlos Santos,Wireless Earbuds,Electronics,1,125.0,2024-07-08,Yes,Portugal
37,1038,Leila Mansouri,Desk Pad,Furniture,1,28.0,2024-07-09,Yes,Iran
38,1039,Daniel Kim,Power Strip,Electronics,2,18.0,2024-07-10,No,South Korea
39,1040,Anna Ivanova,Desk Clock,Furniture,1,35.0,2024-07-11,Yes,Ukraine

CRUD Operations in Pandas

CRUD stands for
C - Create
R - Read
U - Update
D - Delete

In [ ]:
import pandas as pd

df = pd.read_excel("student_data.xlsx")

# Create

# create the new dataframe
new_row = pd.DataFrame([{"Name" : "Manoj", "Branch" : "CSE", "Sem" : 2, "College" : "PVP Polytechnic"}])

# concatenate the new_row to df(student_data.xlsx)
# ignore_index = True (reset the index and assign from first instead of old one)
df = pd.concat([df, new_row], ignore_index=True)

df.head()

                Name Branch  Sem          College
0           Preetham     IS    5  PVP Polytechnic
1             Neeraj     IS    5  PVP Polytechnic
2  Lakshmi Venkatesh     CS    5  PVP Polytechnic
3             Monish     IS    5  PVP Polytechnic
4              Manoj    CSE    2  PVP Polytechnic

In [10]:
# Read (Access Data)

# display the student record whose name is monish (Label-based)
df.loc[df["Name"] == "Monish"]

# display the student record whose row index is 3 (Index-based)
df.iloc[[3]]

     Name Branch  Sem          College
3  Monish     IS    5  PVP Polytechnic

In [16]:
# Update (Modify Values)

# find the Manoj in Name column and assign the CS to Branch column
df.loc[df["Name"] == "Manoj", "Branch"] = "CS"

# Make all the College name or value in column to upper case using string method
df['College'] = df['College'].str.upper()

df.head()

                Name Branch  Sem          College
0           Preetham     IS    5  PVP POLYTECHNIC
1             Neeraj     IS    5  PVP POLYTECHNIC
2  Lakshmi Venkatesh     CS    5  PVP POLYTECHNIC
3             Monish     IS    5  PVP POLYTECHNIC
4              Manoj     CS    2  PVP POLYTECHNIC

In [ ]:
# Delete (Drop Data)

# remove the record which is in index 0 and axis 1 means row
# df = df.drop(0, axis=0)

# display the record whose name is neeraj remove other values
# df = df[df["Name"] == "Neeraj"]

# remove the column from it 'name' 1 axis means column
# df = df.drop("Branch", axis=1)

df.head()

     Name          College
1  Neeraj  PVP POLYTECHNIC

Cleaning Data

In [ ]:
df = pd.read_excel("student_data.xlsx")

# Display total null values in different columns in dataframe
df.isnull().sum()

# Remove the rows which any value is null from dataframe
# inplace = True (means change in original dataframe) 
# df.dropna(inplace=True)

# Fill the null values in college to polytechnic 
# inplace = True (means change in original dataframe)
df.fillna({'College' : "Polytechnic"}, inplace=True)

# Rename the Column name (College to College Name)
df.rename(columns={"College" : "College Name"}, inplace=True)

# Convert the datatype of Sem column float to integer
df["Sem"] = df["Sem"].astype(int)

df.head()

       Name Branch  Sem     College Name
0  Preetham     IS    5      Polytechnic
1    Neeraj     IS    5      Polytechnic
2       NaN     CS    5  PVP Polytechnic
3    Monish     IS    5  PVP Polytechnic
4   Karthik     ME    2  MEI Polytechnic

Analyzing Data

In [62]:

df = pd.read_excel("student_data.xlsx")

# dispaly which data is appear how much times in column
# Count occurrences
df["College Name"].value_counts()

# group by the College name and calculates the average (mean) of the age for each College
df.groupby('College Name')['Age'].mean()

# Sort the DataFrame by the Age column in ascending order
df.sort_values(by="Age", ascending=True)

# Sort the DataFrame by the Age column in deascending order
df.sort_values(by="Age", ascending=False)

           Name  Age Branch  Sem     College Name
8        Suresh   45     CS    2  PVP Polytechnic
7       Sumanth   34     CS    1  SJP Polytechnic
1  Mithun Kumar   25     IS    5  PVP Polytechnic
0      Preetham   23     IS    5  PVP Polytechnic
5   Pruthvi Raj   22     EC    2  MEI Polytechnic
6        Ramesh   21     ME    1  SJP Polytechnic
4       Karthik   20     ME    2  MEI Polytechnic
3        Monish   19     IS    5  PVP Polytechnic
2      Yashwant   18     CS    5  PVP Polytechnic

Saving Data

In [63]:
# convert the dataframe to csv and not include the index
df.to_csv("output.csv", index=False)

# convert the dataframe to xlsx and include the index
df.to_excel("output.xlsx", index=True)

pivot() - reshape long data into wide format

it converts rows into columns - useful when you want to summarize or display data in a table-like form

function : pivot()
purpose : Makes data wide
Converts : Rows into Columns

In [ ]:
import pandas as pd

data = {
	'Month' : ['Jan', 'Jan', 'Feb', 'Feb'],
	'Product' : ['A', 'B', 'A', 'B'],
	'Sales' : [100, 150, 200, 250]
}

df = pd.DataFrame(data)

pivoted = df.pivot(index='Month', columns='Product', values='Sales')
print(pivoted)

Product    A    B
Month
Feb      200  250
Jan      100  150

melt() - reshape wide data into long format
it converts columns into rows - useful for undoing a pivot or preparing data for analysis

purpose : Makes data long
converts : Columns to Rows

In [3]:
# df.melt(id_vars='column to keep', var_name='new_column_name', value_name='new_value_name)
melted = pivoted.reset_index().melt(id_vars='Month', var_name='Product', value_name='Sales')

print(melted)

  Month Product  Sales
0   Feb       A    200
1   Jan       A    100
2   Feb       B    250
3   Jan       B    150

map() 
- Purpose : Apply function to each element in a Series
- Used with : Series (not whole DataFrames)
- Return : A new Series

In [4]:
import pandas as pd

df = pd.DataFrame({'A' : [1, 2, 3, 4]})
df['Squred'] = df['A'].map(lambda x : x ** 2)

df = pd.DataFrame({'A' : ["Mithun", "Manoj", "Vijay", "Mohan"]})
df["Combine"] = df['A'].map(lambda x : x + " Kumar")

# df["Sum two"] = df['A'].map(lambda x : x + 2)

print(df.head())

        A       Combine
0  Mithun  Mithun Kumar
1   Manoj   Manoj Kumar
2   Vijay   Vijay Kumar
3   Mohan   Mohan Kumar

In [ ]:
import pandas as pd

df = pd.read_csv("student_data2.csv")

df["College code"] = df["College Name"].map({"SJP Polytechnic" : 1, "PVP Polytechnic" : 2, "MEI Polytechnic" : 3})

# if the college name matches a key : replace with its code
# if it does not match : result becomes NaN

           Name  Age Branch  Sem     College Name  College code
0        Ganesh   31    EEE    2  SJP Polytechnic           1.0
1       Karthik   20     ME    2  MEI Polytechnic           3.0
2  Mithun Kumar   25     IS    5  MEI Polytechnic           3.0
3        Monish   19     IS    5  PVP Polytechnic           2.0
4      Preetham   23     IS    5      Polytechnic           NaN
5   Pruthvi Raj   22     EC    2      Polytechnic           NaN
6        Ramesh   21     ME    1  SJP Polytechnic           1.0
7       Sumanth   34     CS    1  SJP Polytechnic           1.0
8        Suresh   45     CS    2      Polytechnic           NaN
9      Yashwant   18     CS    5      Polytechnic           NaN

enumerate()

-It is built-in python function that lets you loop through a
list while also getting the index of each item.

In [ ]:
values = [45, 67, 8, 1, 34, 23, 67, 98, 100, 101, 12, 14]

for idx, val in enumerate(values):
    print(idx, val)

# it print both the index value and element in the list but index() function only return one

0 45
1 67
2 8
3 1
4 34
5 23
6 67
7 98
8 100
9 101
10 12
11 14

filter()

- it used to keep only the values that match a condition

- Important note : 
Pandas filter() does NOT filter rows by values.
To filter rows, you must use boolean filtering.

In [ ]:
numbers = [1, 2, 4, 5, 6, 9]

result = list(filter(lambda x : x > 2, numbers))
# filter(function, list)
print(result)

df = pd.DataFrame({
	"Name" : ["John", "Sara", "Mike"],
	"Age" : [20, 22, 21],
    "City" : ["NY", "LA", "SF"]
})

# Filter columns by name
# Keep only the "Name" and "City" columns
df_filtered = df.filter(["Name", "City"])
print(df_filtered)

# Filter columns using startswith
df_filtered = df.filter(like="A")
# this keeps any columns with the letter A in its name (like "Age")

[4, 5, 6, 9]
   Name City
0  John   NY
1  Sara   LA
2  Mike   SF

reduce()

- It takes a list and reduse it to one single value by repeatedly applying a function.

- it is not inbuilt have to import
- form functools import reduse

In [98]:
from functools import reduce

numbers = [1, 4, 6, 7, 8]

total = reduce(lambda a, b: a + b, numbers)
print(total)

26

How it works

- Step 1: 1 + 4 = 5
- Step 2: 5 + 6 = 11
- Step 3: 11 + 7 = 18
- Step 4: 18 + 8 = 26

- reduce combines everything into one value

In [101]:
# Multiply numbers

from functools import reduce

product = reduce(lambda a , b : a * b, numbers)
print(product)

# Using reduse() with pandas

import pandas as pd

df = pd.DataFrame({
	"A" : [1, 2, 3],
	"B" : [4, 5, 6],
	"C" : [7, 8, 9]
})

# Reduse values in a column
# Add all values in column A

result = reduce(lambda a , b : a + b , df["A"])
print(result)

row_sum = reduce(lambda a , b : a + b , [df["A"], df["B"], df["C"]])
print(row_sum)

1344
6
0    12
1    15
2    18
dtype: int64